<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"36805630e0b418f66874c6fd19e32df6abe9dc892d0d3a917bf678f17bc34136","plan_job_ref":"Job terraform plan #53 at https://github.com/suzutan/infra/actions/runs/10644281712","plan_out_hash":"dd284172e15c0df3f1f6c54eb09ed707ee42c899a31ebc0d2186ac98ffac62c1","plan_hash":"d95b161ff17915baa73342c5be82af2827fa15982b11c83789b57edec6790ce0","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform/harvestasya.org__
<details>
<summary>Plan: 1 to add, 1 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place

Terraform will perform the following actions:

  # cloudflare_record.storage_ingress["cdn.harvestasya.org"] will be created
+   resource "cloudflare_record" "storage_ingress" {
+       allow_overwrite = false
+       content         = (known after apply)
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "cdn.harvestasya.org"
+       proxiable       = (known after apply)
+       proxied         = true
+       ttl             = (known after apply)
+       type            = "CNAME"
+       value           = "ae14e5bc-d84e-4719-ab38-df8ca6664918.cfargotunnel.com"
+       zone_id         = "********************************"
    }

  # cloudflare_tunnel_config.storage_ingress will be updated in-place
!~  resource "cloudflare_tunnel_config" "storage_ingress" {
        id         = "ae14e5bc-d84e-4719-ab38-df8ca6664918"
#        (2 unchanged attributes hidden)

!~      config {
!~          ingress_rule {
!~              hostname = "storage-console.harvestasya.org" -> "cdn.harvestasya.org"
#                (2 unchanged attributes hidden)

!~              origin_request {
!~                  http_host_header         = "storage-console.harvestasya.org" -> "cdn.harvestasya.org"
!~                  origin_server_name       = "storage-console.harvestasya.org" -> "cdn.harvestasya.org"
#                    (14 unchanged attributes hidden)
                }
            }
!~          ingress_rule {
!~              hostname = "storage.harvestasya.org" -> "storage-console.harvestasya.org"
#                (2 unchanged attributes hidden)

!~              origin_request {
!~                  http_host_header         = "storage.harvestasya.org" -> "storage-console.harvestasya.org"
!~                  origin_server_name       = "storage.harvestasya.org" -> "storage-console.harvestasya.org"
#                    (14 unchanged attributes hidden)
                }
            }
!~          ingress_rule {
+               hostname = "storage.harvestasya.org"
!~              service  = "http_status:404" -> "https://traefik"
#                (1 unchanged attribute hidden)

+               origin_request {
+                   connect_timeout          = "30s"
+                   disable_chunked_encoding = false
+                   http2_origin             = false
+                   http_host_header         = "storage.harvestasya.org"
+                   keep_alive_connections   = 100
+                   keep_alive_timeout       = "1m30s"
+                   no_happy_eyeballs        = false
+                   no_tls_verify            = true
+                   origin_server_name       = "storage.harvestasya.org"
+                   proxy_address            = "127.0.0.1"
+                   proxy_port               = 0
+                   tcp_keep_alive           = "30s"
+                   tls_timeout              = "10s"
                }
            }
+           ingress_rule {
+               service = "http_status:404"
            }
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

Warning: Deprecated Resource

  with cloudflare_tunnel.k8s_ingress,
  on tunnel_k8s.tf line 17, in resource "cloudflare_tunnel" "k8s_ingress":
  17: resource "cloudflare_tunnel" "k8s_ingress" {

`cloudflare_tunnel` is now deprecated and will be removed in the next major
version. Use `cloudflare_zero_trust_tunnel_cloudflared` instead.

(and 7 more similar warnings elsewhere)

Warning: Argument is deprecated

  with cloudflare_record.k8s_ingress["grafana.harvestasya.org"],
  on tunnel_k8s.tf line 49, in resource "cloudflare_record" "k8s_ingress":
  49:   value    = "${cloudflare_tunnel.k8s_ingress.id}.cfargotunnel.com"

`value` is deprecated in favour of `content` and will be removed in the next
major release.

(and 17 more similar warnings elsewhere)
```
</details>

:memo: Plan generated in [terraform plan #53](https://github.com/suzutan/infra/actions/runs/10644281712)